load-test.yml
config:
  target: "http://localhost:8000"
  phases:
    # Light load test for 5.6GB RAM PC
    - duration: 20
      arrivalRate: 2
      name: "Warm up - 2 users/sec"
    - duration: 30
      arrivalRate: 5
      name: "Ramp up - 5 users/sec"
    - duration: 30
      arrivalRate: 10
      name: "Peak load - 10 users/sec"
    - duration: 20
      arrivalRate: 3
      name: "Cool down - 3 users/sec"

scenarios:
  - name: "Complete User Journey"
    weight: 70
    flow:
      # Register
      - post:
          url: "/api/auth/register"
          json:
            name: "user{{ $randomNumber() }}"
            email: "test{{ $randomNumber() }}@loadtest.com"
            password: "Test123!@#"
          capture:
            - json: "$.token"
              as: "token"
          expect:
            - statusCode: 201

      # Get Profile
      - get:
          url: "/api/profile"
          headers:
            Authorization: "Bearer {{ token }}"
          expect:
            - statusCode: 200

      # Update Profile
      - put:
          url: "/api/profile"
          headers:
            Authorization: "Bearer {{ token }}"
          json:
            bio: "Load test user - automated"
            skillsHave: ["JavaScript", "Python", "React"]
            skillsWant: ["Go", "Rust", "Kubernetes"]
          expect:
            - statusCode: 200

      # Find Matches
      - get:
          url: "/api/match/matches"
          headers:
            Authorization: "Bearer {{ token }}"
          expect:
            - statusCode: 200

  - name: "Login and Browse"
    weight: 30
    flow:
      # Register first
      - post:
          url: "/api/auth/register"
          json:
            name: "browser{{ $randomNumber() }}"
            email: "browse{{ $randomNumber() }}@loadtest.com"
            password: "Test123!@#"
          capture:
            - json: "$.token"
              as: "token"

      # Multiple profile views
      - loop:
          - get:
              url: "/api/profile"
              headers:
                Authorization: "Bearer {{ token }}"
        count: 3

      # Multiple match searches
      - loop:
          - get:
              url: "/api/match/matches"
              headers:
                Authorization: "Bearer {{ token }}"
        count: 2